//
//  Push.swift
//  Skyline
//
//  Created by MacBook Pro  on 07.08.2022.
//Оповещения работают следующим образом, когда происходит первый запуск программы программа записывает текущий депозит в память телефона, когда депозит становится меньше записаного в памяти телефона, происходит Проверка на смену депозита, если депозита достаточно для оплаты услуг оповещения не придет, если депозит будет меньше стоимости услуг придет оповещение с суммой которую нужно внести для активации сервисов. Проверка происходит с интервалом в 6 часов.



import Foundation
